In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [6]:
dframe1 = DataFrame(np.arange(8).reshape((2,4)),
                   index = pd.Index(['LA','SF'],name = 'city'),
                   columns = pd.Index(['A','B','C','D'], name = 'letter'))

In [7]:
dframe1

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [8]:
dframe1.stack()

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [12]:
dframe_st = dframe1.stack()

In [13]:
dframe_st

city  letter
LA    A         0
      B         1
      C         2
      D         3
SF    A         4
      B         5
      C         6
      D         7
dtype: int32

In [14]:
dframe_st.unstack()

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [15]:
dframe_st.unstack(0)

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [16]:
dframe_st.unstack(1)

letter  A  B  C  D
city
LA      0  1  2  3
SF      4  5  6  7

In [17]:
dframe_st.unstack('city')

city    LA  SF
letter
A        0   4
B        1   5
C        2   6
D        3   7

In [21]:
ser1 = Series([0,1,2], index = ['q','x','y'])
ser2 = Series([4,5,6], index = ['x','y','z'])

In [24]:
series = pd.concat([ser1, ser2], keys = ['Alpha','Beta'])

In [25]:
series

Alpha  q    0
       x    1
       y    2
Beta   x    4
       y    5
       z    6
dtype: int64

In [26]:
series.unstack()

         q    x    y    z
Alpha  0.0  1.0  2.0  NaN
Beta   NaN  4.0  5.0  6.0

In [30]:
series.unstack(0)

   Alpha  Beta
q    0.0   NaN
x    1.0   4.0
y    2.0   5.0
z    NaN   6.0

In [31]:
dframe.unstack().stack()

Alpha  q    0.0
       x    1.0
       y    2.0
Beta   x    4.0
       y    5.0
       z    6.0
dtype: float64

In [32]:
dframe.unstack().stack(dropna = False)

Alpha  q    0.0
       x    1.0
       y    2.0
       z    NaN
Beta   q    NaN
       x    4.0
       y    5.0
       z    6.0
dtype: float64